import UIKit

/*
 문제 설명
 오목은 15 x 15 크기의 오목판에 두 명의 플레이어가 교대로 돌을 놓아 가로, 세로, 혹은 대각선 방향으로 같은 색의 돌 다섯 개를 일렬로 먼저 늘어놓으면 승리하는 게임입니다. 오목판은 가로 15줄, 세로 15줄의 격자형 모양으로 되어있는데, 돌을 둘 때는 가로줄과 세로줄의 교차점에만 둘 수 있습니다.
 
 board의 크기는 항상 15 x 15입니다.
 board의 각 원소에는 0, 1, 2의 숫자가 적혀있으며 1은 검은 돌, 2는 흰 돌, 0은 돌이 놓여있지 않음을 나타냅니다.
 같은 색의 돌 다섯개를 하나라도 먼저 완성하는 사람이 승리하며, 검은 돌과 흰 돌이 동시에 승리하는 경우는 주어지지 않습니다.
 항상 정상적으로 게임이 진행된 상태만 입력으로 주어집니다.
 문제에서 설명한 승리 규칙 외에 다른 규칙 없이 게임이 진행됐다고 가정합니다.
 흑과 백이 동시에 승리하는 등 정상적으로 게임이 진행됐을 때 나올 수 없는 모양은 입력으로 주어지지 않습니다.
 */
